#Installs on OSX only
if OS.mac?
  tap "homebrew/bundle"
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"
  tap "homebrew/core"
  tap "homebrew/services"
  tap "homebrew/cask-drivers"
  tap "wallix/awless"
  tap "mas-cli/tap", pin: true
  #some apps requires java, sshfs requires fuse
  cask "java"
  cask "adoptopenjdk"
  cask "osxfuse"
  #Brews
  brew "ack"
  brew "arping"
  brew "awless"
  brew "aws-shell"
  brew "awscli"
  brew "bash"
  brew "bash-completion"
  brew "certigo"
  brew "coreutils"
  brew "curl"
  brew "dhcpdump"
  brew "dhcping"
  brew "dnsperf"
  brew "dnstracer"
  brew "docker"
  brew "docker-compose"
  brew "docker-machine"
  brew "dos2unix"
  brew "elinks"
  brew "ettercap"
  brew "exa"
  brew "ffmpeg"
  brew "findutils"
  brew "flowgrind"
  brew "fping"
  brew "foremost"
  brew "gawk"
  brew "git"
  brew "git-extras"
  brew "git-lfs"
  brew "git-secret"
  brew "git-secrets"
  brew "gnu-sed"
  brew "gnupg2"
  brew "go"
  brew "graphicsmagick"
  brew "grep"
  brew "hadoop"
  brew "hashpump"
  brew "hopenpgp-tools"
  brew "htop"
  brew "httperf"
  brew "httpie"
  brew "httping"
  brew "httpry"
  brew "httpstat"
  brew "hub"
  brew "imagemagick"
  brew "iperf3"
  brew "ipmitool"
  brew "john-jumbo"
  brew "lazygit"
  brew "lzo"
  brew "m-cli"
  brew "mas"
  brew "midnight-commander"
  brew "mitmproxy"
  brew "mobile-shell"
  brew "moreutils"
  brew "mtr"
  brew "mutt"
  brew "nmap"
  brew "openssh"
  brew "p7zip"
  brew "pigz"
  brew "pngcheck"
  brew "pngcrush"
  brew "privoxy"
  brew "pwgen"
  brew "qemu"
  brew "recon-ng"
  brew "screen"
  brew "sipcalc"
  brew "smartmontools"
  brew "socat"
  brew "sqlite"
  brew "sqlmap"
  brew "ssh-audit"
  brew "sshfs"
  brew "sslscan"
  brew "sysdig"
  brew "tcpreplay"
  brew "tcptrace"
  brew "telnet"
  brew "tig"
  brew "tmux"
  brew "tree"
  brew "unrar"
  brew "upx"
  brew "util-linux"
  brew "vagrant-completion"
  brew "vim"
  brew "wakeonlan"
  brew "wget"
  brew "whois"
  brew "xz"
  brew "youtube-dl"
  brew "zsh"
  brew "zsh-completions"
  #Casks
  cask "adoptopenjdk"
  cask "alfred"
  cask "android-platform-tools"
  cask "apache-directory-studio"
  cask "bettertouchtool"
  cask "charles"
  cask "commander-one"
  cask "dropbox"
  cask "freesmug-chromium"
  cask "gns3"
  cask "google-chrome"
  cask "iterm2"
  cask "java"
  cask "keybase"
  cask "lens"
  cask "netspot"
  cask "openvisualtraceroute"
  cask "plexamp"
  cask "plex-media-player"
  cask "royal-tsx"
  cask "sequel-pro"
  cask "skype"
  cask "spectacle"
  cask "spotify"
  cask "teamspeak-client"
  cask "teamviewer"
  cask "telegram"
  cask "tower"
  cask "transmission"
  cask "transmission-remote-gui"
  cask "tuntap"
  cask "vagrant"
  cask "viscosity"
  cask "visual-studio-code"
  cask "visualvm"
  cask "vlc"
  cask "vmware-fusion"
  cask "nrlquaker-winbox"
  cask "wireshark"
  cask "xca"
  cask "xquartz"
  #Fonts
  cask "font-anonymous-pro"
  cask "font-fira-code"
  cask "font-hack"
  cask "font-input"
  cask "font-iosevka"
  cask "font-source-code-pro"
  cask "font-terminus"
  #MAS
  mas "1Password", id: 443987910
  mas "Airmail 3", id: 918858936
  mas "Amphetamine", id: 937984704
  mas "Droplr", id: 498672703
  mas "ForkLift", id: 412448059
  mas "Microsoft Remote Desktop", id: 1295203466
  mas "Monosnap", id: 540348655
  mas "Pixelmator", id: 407963104
  mas "Textual", id: 896450579
  mas "Tweetbot", id: 1384080005
end

#Installs on both linux & osx
tap "derailed/k9s"
#kubernetes stuff
brew "velero"
brew "k9s"
brew "krew"
brew "kubectl"
brew "octant"
brew "calicoctl"
brew "helm"
brew "istioctl"
#misc stuff
brew "shellcheck"
brew "shfmt"